Table of Contents
 Class SectionResultOnPoints
Namespace
IdeaRS.OpenModel.Result
Assembly
IdeaRS.OpenModel.dll
Section result of points
[Obfuscation(Feature = "renaming")]
public class SectionResultOnPoints : SectionResultBase
Inheritance
object
SectionResultBase
SectionResultOnPoints
Inherited Members
 SectionResultBase.Loading
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 SectionResultOnPoints()
Constructor
public SectionResultOnPoints()
Properties
 Points
Section points
public List<PointResults> Points { get; set; }
Property Value
List<PointResults>
 Edit this page